<!DOCTYPE html>
<html lang="fr-FR" prefix="og: http://ogp.me/ns#">
 <head>
  <!-- Favicon -->
  <link href="https://www.hack-with-hyweene.com/static/img/cl-logo.svg" rel="icon">
  <meta charset="utf-8">
  <meta content="width=device-width, initial-scale=1, minimum-scale=1.0, maximum-scale=5.0" name="viewport">
  <meta content="IE=edge" http-equiv="X-UA-Compatible">
  <meta content="telephone=no" name="format-detection">
  <meta content="Bruno 'Hyweene' Giarrizzo" name="author">
  <meta content="Hack with Hyweene" name="webmaster">
  <meta content="fr" name="language">
  <meta content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" name="robots">
  <meta content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" name="googlebot">
  <meta content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" name="bingbot">
  <meta content="1 days" name="revisit-after">
  <meta content="never" name="expires">
  <meta content="General" name="rating">
  <meta content="yes" name="apple-mobile-web-app-capable">
  <meta content="https://www.hack-with-hyweene.com" name="identifier-URL">
  <link href="https://www.hack-with-hyweene.com/blog/feed.xml" rel="alternate" title="Hack with Hyweene - Blog RSS" type="application/rss+xml">
  <title>Bruno Giarrizzo - CV - Hack with Hyweene</title>
  <meta content="Bruno Giarrizzo - CV - Hack with Hyweene" name="title">
  <link href="https://www.hack-with-hyweene.com/" rel="canonical">
  <link href="/static/css/prism.css" rel="stylesheet">
  <!-- Google tag (gtag.js) -->
  <script async src="https://www.googletagmanager.com/gtag/js?id=G-S4T0SNK38Q">
  </script>
  <script src="/static/js/analytics.js">
  </script>
  <style>body { margin: 0 auto; max-width: 700px; line-height: 1.8; font-family: 'Latin Modern', Georgia, Cambria, 'Times New Roman', Times, serif; font-size: 1rem; color: #444; background-color: #fdf6e3; padding: 20px 40px; text-rendering: optimizeLegibility; }
    h1 { line-height: 1.2; text-align: center; }
    h2, h3, h4 { line-height: 1.2; border-bottom: 1px solid; }
    p { hyphens: auto; text-align: justify; }
    pre, blockquote, .code { background: #f5ead6; font-size: 0.8em; padding: 1em; overflow: scroll; border-radius: 0.5em; }
    ul, ol { list-style-type: circle; }
    a { color: #169; text-decoration: none; padding: 0.5em 0; }
    a:hover { text-decoration: underline; }
    
    nav { display: flex; align-items: center; justify-content: space-between; flex-direction: row; text-align: center; font-variant: small-caps; font-weight: bold; border-bottom: 1px solid; border-top: 1px solid; margin-bottom: 1.5em; }
    
    main { text-align: justify; }
    main hr { margin-top: 1.5em; margin-bottom: 1.5em; }

    .cover { display: block; width: 100%; border-radius: 0.5em; }

    figure { width: 65%; display: block; margin-left: auto; margin-right: auto;}
    figure img { width: 100%; box-shadow: rgba(0, 0, 0, 0.35) 0px 5px 15px; border-radius: 0.5em; }
    figure figcaption { text-align: center; font-style: italic; }

    footer { margin-top: 1.5em; }

    code { background: #f8cca0; padding: 0.25em;  margin-right: 0.5em; border-radius: 0.5em; }</style>
 </head>
 <body>
  <header>
   <h1><a href="/">Hack with Hyweene</a></h1>
  </header>
  <nav><a href="/blog/">Blog</a>&bull; <a href="/liens/">Liens</a>&bull; <a href="/apprendre/">Apprendre</a>&bull; <a href="/cv/">CV</a></nav>
  <main>
   <img alt="resume cover image" class="cover" src="/media/images/pages/resume/cover.png">
   <h1 class="text-4xl font-semibold mb-5">CV</h1>
   <hr>
   <h2>Bruno Giarrizzo</h2>
   <ul>
    <li>D&eacute;veloppeur Python, Golang &amp; DevOps</li>
    <li>
     <p><strong>Localisation</strong>: Lille, 59000, Nord, France</p>
    </li>
    <li>
     <p><strong>Exp&eacute;rience</strong>:</p>
     <ul>
      <li>En tant que SysOps/DevOps : 10 ans</li>
      <li>En tant que D&eacute;veloppeur Python : 4 ans</li>
      <li>En tant que D&eacute;veloppeur Golang : 1 an</li>
     </ul>
    </li>
   </ul>
   <h3>Mes techno pr&eacute;f&eacute;r&eacute;es</h3>
   <ul>
    <li>Python (avec FastAPI)</li>
    <li>Golang</li>
    <li>Swift</li>
    <li>Kubernetes</li>
    <li>Terraform</li>
    <li>Helm</li>
   </ul>
   <h2>Experiences Professionnelles</h2>
   <section>
    <h3>Adeo Services (Leroy Merlin)</h3>
    <p class="font-bold">D&eacute;veloppeur DevOps - (Contrat Freelance) : 2022/06 -&gt; Aujourd'hui</p>
    <p>Dans une &eacute;quipe de 6 personnes, travaillant &agrave; moiti&eacute; &agrave; distance et sur site, nous collaborons avec des &eacute;quipes en France, au Br&eacute;sil et en Russie. Ma mission est d'aider &agrave; cr&eacute;er la plateforme de streaming de donn&eacute;es d'Adeo avec Apache Kafka, en construisant des API et des passerelles en libre-service, et en cr&eacute;ant des flux de donn&eacute;es entre GCP et plusieurs plateformes.</p>
    <h4>Environnement technique</h4>
    <ul>
     <li>Google Cloud Platform + GKE</li>
     <li>Google BigQuery, Cloud SQL, AppEngine</li>
     <li>Docker, Kubernetes, Helm</li>
     <li>Python 3.10</li>
     <li>Go 1.17.x +</li>
     <li>Apache Kafka</li>
    </ul>
    <footer>#Go #Golang #Python #Kafka #REST API #Docker #Kubernetes #Google Cloud Platform #GKE #Github #Github Actions #Terraform</footer>
   </section>
   <section>
    <h3>BNP Paribas - Corporate Institutional Banking (CIB)</h3>
    <p class="font-bold">D&eacute;veloppeur - (Contrat Freelance) : 2020/09 -&gt; 2022/06</p>
    <p>Dans une &eacute;quipe de 15 d&eacute;veloppeurs et contributeurs, r&eacute;partis en France, au Royaume-Uni, en Espagne, aux &Eacute;tats-Unis, en Inde et en Chine, je suis responsable de deux applications.</p>
    <ul>
     <li>La premi&egrave;re est un planificateur de mises &agrave; jour de tous les h&ocirc;tes virtuels (Python 2.7 / Django 1.11)</li>
     <li>La seconde est une API g&eacute;rant l'inventaire des h&ocirc;tes baremetal (Python 3.10 / FastAPI)</li>
    </ul>
    <p>Je suis &eacute;galement impliqu&eacute; dans la refonte de l'API de la biblioth&egrave;que Product as Code utilis&eacute;e dans CIB et plus tard dans le Groupe BNPP (Python 3.10, FastAPI, PostGres, Celery, Redis, Apache Airflow, OPA/OPAL)</p>
    <h4>Environnement technique</h4>
    <ul>
     <li>Linux (Redhat / Ubuntu), Microsoft Windows server</li>
     <li>Plus de 50000 serveurs virtuels ou BareMetal.</li>
     <li>Debian 9.x, Ubuntu 18.04, 20.04</li>
     <li>Python 3.6, 3.7, 3.8, 3.9, 3.10</li>
     <li>Django 1.11, Fastapi 0.75.x, Flask 1.x</li>
     <li>Docker, Kubernetes, Helm, Ansible</li>
     <li>Apache Airflow, OPAL/OPA</li>
     <li>MongoDB, Redis, PostgreSQL</li>
    </ul>
    <footer>#Python #Python 2.7 #Python 3.6 #Python 3.8 #Python 3.9 #Flask #FastAPI #Django #REST API #Airflow #Docker #Kubernetes #Ansible #Mongodb</footer>
   </section>
   <section>
    <h3>Motoblouz</h3>
    <p class="font-bold">DevOps - (CDI) : 2017/09 -&gt; 2019/11</p>
    <p>Dans une &eacute;quipe IT de 10 personnes, collaborant en mode AGILE. J'&eacute;tais en charge de la mise &agrave; niveau de l'infrastructure IT, de l'automatisation, de toutes les am&eacute;liorations des pipelines CI/CD.</p>
    <ul>
     <li>R&eacute;duction des incidents d'astreinte de plus de 190 &agrave; moins de 70 par an gr&acirc;ce &agrave; la configuration automatis&eacute;e des serveurs et des applications</li>
     <li>Mise &agrave; niveau de la surveillance pour surveiller les API</li>
     <li>Automatisation des pipelines de donn&eacute;es BI et &eacute;conomie de plus de 10 heures de travail par semaine</li>
     <li>Mise en place d'un service de streaming TV pour les communications en magasin et &eacute;conomie de 10K&euro; par an</li>
     <li>R&eacute;duction des d&eacute;chets &eacute;lectroniques en recyclant d'anciens PoS pour cr&eacute;er des tiroirs-caisses partag&eacute;s pilot&eacute;s par API</li>
    </ul>
    <h4>Environnement technique</h4>
    <ul>
     <li>OpenSource</li>
     <li>35 serveurs Linux virtuels ou BareMetal.</li>
     <li>40 conteneurs docker (Alpine, Debian, Ubuntu).</li>
     <li>Debian (8.x et 9.x), Docker 18.x</li>
     <li>Nginx 1.10, PHP 5.4, 7.1, 7.2, 7.3, MySQL 5.5 &amp; 5.7</li>
     <li>Stack ELK 6.x</li>
     <li>Gitlab 9.x &agrave; 12.x</li>
     <li>Ansible 2.4 &agrave; 2.8</li>
     <li>Zabbix 3.2 et 3.4</li>
    </ul>
    <footer>#Debian #Ubuntu #Raspbian #Bash #Python #Docker #Ansible #Jenkins #Gitlab #haproxy #varnish #nginx #php #mysql #redis #ELK #Grafana #Prometheus #Zabbix</footer>
   </section>
   <section>
    <h3>Altima Hosting</h3>
    <p class="font-bold">SysOps - (CDI) : 2017/04 -&gt; 2017/07</p>
    <p>Administrateur Syst&egrave;me + Cybers&eacute;curit&eacute;.</p>
    <p>Op&eacute;rations d'h&eacute;bergement IT :</p>
    <ul>
     <li>Gestion des tickets de niveau 1 &agrave; 3 et des incidents</li>
     <li>Gestion des comptes LDAP</li>
     <li>Gestion des sauvegardes</li>
     <li>Approvisionnement de serveurs virtuels</li>
     <li>Gestion de l'hyperviseur VMWare</li>
    </ul>
    <h4>Environnement technique</h4>
    <ul>
     <li>Linux (ubuntu/Debian), Microsoft Windows server</li>
     <li>200 serveurs (Virtuels ou BareMetal).</li>
     <li>Virtualisation : VMWare</li>
     <li>Debian 7.x, 8.x, Ubuntu 14.04, 16.04</li>
     <li>Apache 2.4, Nginx 1.10, php 7.0, mysql 5.5 &amp; 5.7</li>
     <li>Zabbix 3.0</li>
    </ul>
    <footer>#Debian #Ubuntu #Bash #Python #Apache2 #Nginx #php #mysql #Windows Server #Zabbix #LDAP #VMWare</footer>
   </section>
   <section>
    <h3>Decathlon</h3>
    <p class="font-bold">Chef de Projet - (Apprentissage) : 2015/11 -&gt; 2017/04</p>
    <p>Mes deux missions principales impliquaient la cr&eacute;ation d'une passerelle d'acc&egrave;s s&eacute;curis&eacute;e afin de prot&eacute;ger et d'enregistrer toutes les actions sur les serveurs h&eacute;bergeant des donn&eacute;es personnelles ; et la mise en place de HSM pour stocker les cl&eacute;s de chiffrement puis la configuration du chiffrement des bases de donn&eacute;es h&eacute;bergeant des donn&eacute;es personnelles.</p>
    <h4>Environnement technique</h4>
    <ul>
     <li>Cloud AWS, GCP</li>
     <li>Datacenter OnPremise</li>
    </ul>
   </section>
   <section>
    <h3>Motoblouz</h3>
    <p class="font-bold">SysSecOps - (Stage) : 2015/01 -&gt; 2015/08</p>
    <p>Durant un stage de ma Licence Professionnelle en Cybers&eacute;curit&eacute;. J'ai travaill&eacute; avec un pure-player du e-commerce.</p>
    <p>Les deux sujets principaux &eacute;taient :</p>
    <ul>
     <li>D&eacute;ploiement d'une solution de s&eacute;curit&eacute; Wifi, o&ugrave; les utilisateurs pouvaient se connecter au Wifi via Radius/EAP (Windows/OSX/Ubuntu).</li>
     <li>Test d'intrusion de l'infrastructure de production et de pr&eacute;-production. Analyse forensique d'un serveur isol&eacute; qui avait &eacute;t&eacute; attaqu&eacute; et infect&eacute;, puis application de contre-mesures.</li>
    </ul>
    <h4>Environnement technique</h4>
    <ul>
     <li>Microsoft Windows Server + Active Directory</li>
     <li>&Eacute;quipement Wifi TP-LINK</li>
     <li>Serveurs Debian/Ubuntu</li>
     <li>Python / Bash</li>
    </ul>
    <footer>#Debian #Ubuntu #Raspbian #Bash #Apache #php #mysql #Zabbix</footer>
   </section>
   <section>
    <h3>Mairie de Denain</h3>
    <p class="font-bold">SysOps - (Apprentissage) : 2013/09 -&gt; 2014/08</p>
    <p>Assistance &agrave; l'administrateur syst&egrave;me principal dans ses t&acirc;ches de gestion informatique.</p>
    <ul>
     <li>D&eacute;ploiement d'une solution de surveillance bas&eacute;e sur Nagios/Centreon pour v&eacute;rifier la connectivit&eacute; et les performances des liens distants.</li>
     <li>Mise en place de la gestion du parc informatique (OCS Inventory &amp; GLPI)</li>
     <li>D&eacute;veloppement de l'utilisation de clients l&eacute;gers afin de r&eacute;duire les co&ucirc;ts mat&eacute;riels.</li>
    </ul>
    <h4>Environnement technique</h4>
    <ul>
     <li>Microsoft Windows Server 2008</li>
     <li>Active Directory</li>
     <li>Microsoft HyperV</li>
     <li>GLPI + OCS</li>
     <li>Nagios + Centreon</li>
    </ul>
   </section>
   <h2>Education</h2>
   <section>
    <h3>Master Of Science</h3>
    <p class="font-bold">Supinfo (Valenciennes, 59) - Work-study program : 2015 -&gt; 2017 ( Done )</p>
    <p>Le Master of Science de SUPINFO m'a permis d'acqu&eacute;rir une expertise approfondie dans le domaine des technologies de l'information et de la communication. Cette formation de haut niveau combine des enseignements th&eacute;oriques pouss&eacute;s et une forte orientation pratique &agrave; travers des projets concrets et des p&eacute;riodes en entreprise.</p>
    <p>Au cours de ce cursus, j'ai d&eacute;velopp&eacute; des comp&eacute;tences avanc&eacute;es dans des domaines tels que :</p>
    <ul>
     <li>L'architecture et l'administration des syst&egrave;mes et r&eacute;seaux</li>
     <li>Le d&eacute;veloppement d'applications complexes et distribu&eacute;es</li>
     <li>La gestion de projets informatiques et le management d'&eacute;quipes</li>
     <li>La s&eacute;curit&eacute; des syst&egrave;mes d'information et la cybers&eacute;curit&eacute;</li>
     <li>L'intelligence artificielle et le big data</li>
     <li>Le cloud computing et les technologies &eacute;mergentes</li>
    </ul>
    <p>La formation m'a &eacute;galement permis de me sp&eacute;cialiser dans [mentionnez votre sp&eacute;cialisation si applicable], tout en conservant une vision globale des enjeux technologiques actuels.</p>
    <p>Gr&acirc;ce &agrave; l'alternance et aux projets r&eacute;alis&eacute;s en collaboration avec des entreprises partenaires, j'ai pu mettre en pratique ces comp&eacute;tences dans un contexte professionnel et d&eacute;velopper mon autonomie. Cette exp&eacute;rience m'a pr&eacute;par&eacute; &agrave; occuper des postes &agrave; responsabilit&eacute; dans le domaine de l'informatique, tels qu'architecte logiciel, chef de projet IT, ou expert en cybers&eacute;curit&eacute;.</p>
   </section>
   <section>
    <h3>Licence Pro - CyberDefense</h3>
    <p class="font-bold">IUT Valenciennes (Maubeuge, 59) - Full-time education : 2014 -&gt; 2015 ( Done )</p>
    <p>La licence professionnelle CDAISI m'a permis d'acqu&eacute;rir des comp&eacute;tences avanc&eacute;es en cybers&eacute;curit&eacute; et protection des syst&egrave;mes d'information. Au cours de cette formation, j'ai d&eacute;velopp&eacute; une expertise dans :</p>
    <ul>
     <li>La r&eacute;alisation d'audits de s&eacute;curit&eacute; et la s&eacute;curisation de syst&egrave;mes informatiques d'entreprises</li>
     <li>L'analyse et la gestion des vuln&eacute;rabilit&eacute;s des r&eacute;seaux, syst&egrave;mes et applications</li>
     <li>La mise en place de solutions de protection contre les intrusions et cyberattaques</li>
     <li>L'utilisation d'outils et techniques de forensique num&eacute;rique</li>
     <li>La conduite de tests d'intrusion et d'&eacute;valuations de s&eacute;curit&eacute;</li>
     <li>La gestion de projets de s&eacute;curit&eacute; informatique</li>
    </ul>
    <p>Cette formation m'a &eacute;galement apport&eacute; des connaissances approfondies en cryptologie, gestion des syst&egrave;mes d'exploitation, et aspects juridiques de la cybers&eacute;curit&eacute;. Les projets pratiques et stages en entreprise m'ont permis de mettre en application ces comp&eacute;tences dans des environnements professionnels r&eacute;els, me pr&eacute;parant ainsi &agrave; r&eacute;pondre efficacement aux enjeux actuels de la s&eacute;curit&eacute; des syst&egrave;mes d'information.</p>
   </section>
   <section>
    <h3>Licence Pro - IT Management</h3>
    <p class="font-bold">UVHC (Maubeuge, 59) - Work-study program : 2013 -&gt; 2014 ( Done )</p>
    <p>La licence professionnelle en informatique de gestion m'a permis d'acqu&eacute;rir une double comp&eacute;tence en informatique et en gestion des syst&egrave;mes d'information. Au cours de cette formation, j'ai d&eacute;velopp&eacute; des comp&eacute;tences techniques en programmation, bases de donn&eacute;es, r&eacute;seaux et s&eacute;curit&eacute; informatique, tout en approfondissant mes connaissances en gestion de projet, analyse des besoins et management des syst&egrave;mes d'information.</p>
    <p>Cette formation m'a pr&eacute;par&eacute; &agrave; concevoir, d&eacute;velopper et maintenir des solutions logicielles adapt&eacute;es aux besoins des entreprises. J'ai notamment appris &agrave; :</p>
    <ul>
     <li>Analyser les processus m&eacute;tier et les traduire en cahiers des charges</li>
     <li>D&eacute;velopper des applications de gestion et des interfaces utilisateurs</li>
     <li>Administrer des bases de donn&eacute;es et des syst&egrave;mes d'information</li>
     <li>Assurer la s&eacute;curit&eacute; et la maintenance des infrastructures informatiques</li>
     <li>G&eacute;rer des projets informatiques et accompagner le changement</li>
    </ul>
    <p>Gr&acirc;ce aux projets et stages r&eacute;alis&eacute;s, j'ai pu mettre en pratique ces comp&eacute;tences dans un contexte professionnel et d&eacute;velopper mon autonomie. Cette formation m'a ainsi pr&eacute;par&eacute; &agrave; occuper des postes tels que d&eacute;veloppeur d'applications, administrateur de bases de donn&eacute;es ou assistant chef de projet informatique.</p>
   </section>
   <section>
    <h3>BTS - IT Services</h3>
    <p class="font-bold">Lyc&eacute;e Henri Wallon (Valenciennes, 59) - Full-time education : 2011 -&gt; 2013 ( Done )</p>
    <p>Le BTS SIO est une formation de niveau bac+2 qui m'a permis d'acqu&eacute;rir des comp&eacute;tences solides dans le domaine des services informatiques aux organisations. Ce cursus allie enseignements th&eacute;oriques et pratiques, couvrant des domaines tels que le support et la mise &agrave; disposition de services informatiques, le d&eacute;veloppement d'applications, la gestion de r&eacute;seaux et la cybers&eacute;curit&eacute;.</p>
    <p>Au cours de cette formation, j'ai d&eacute;velopp&eacute; des comp&eacute;tences en gestion de projet informatique, en administration de syst&egrave;mes et r&eacute;seaux, ainsi qu'en conception et d&eacute;veloppement de solutions logicielles. J'ai &eacute;galement acquis une expertise en mati&egrave;re de s&eacute;curit&eacute; des syst&egrave;mes d'information, un aspect crucial dans l'environnement num&eacute;rique actuel.</p>
    <p>Les stages en entreprise int&eacute;gr&eacute;s au programme m'ont permis d'appliquer ces connaissances dans des situations professionnelles concr&egrave;tes, renfor&ccedil;ant ainsi mon exp&eacute;rience pratique et ma compr&eacute;hension des enjeux du secteur. Cette formation m'a pr&eacute;par&eacute; &agrave; r&eacute;pondre efficacement aux besoins informatiques des organisations, en tenant compte des &eacute;volutions technologiques rapides et des exigences de s&eacute;curit&eacute; croissantes.</p>
   </section>
   <section>
    <h3>BacPro - Workstation, Networks, Installation &amp; Maintenance</h3>
    <p class="font-bold">Lyc&eacute;e Fernand L&eacute;ger (Coudekerque-Branche, 59) - Full-time education : 2007 -&gt; 2009 ( Done )</p>
    <p>Le Bac professionnel MRIM est une formation qui m'a permis d'acqu&eacute;rir des comp&eacute;tences solides en installation et maintenance de parcs informatiques et de r&eacute;seaux.</p>
    <p>Au cours de ce cursus, j'ai d&eacute;velopp&eacute; une expertise dans l'assemblage de mat&eacute;riel, la configuration logicielle, ainsi que le d&eacute;pannage tant hardware que software.</p>
    <p>La formation a altern&eacute; entre des enseignements th&eacute;oriques et des travaux pratiques, me permettant d'appliquer mes connaissances dans des situations r&eacute;elles.</p>
    <p>De plus, mes stages en entreprise ont renforc&eacute; mon exp&eacute;rience professionnelle, me pr&eacute;parant &agrave; des m&eacute;tiers tels que technicien informatique, technicien r&eacute;seau et technicien de maintenance.</p>
   </section>
  </main>
  <footer>
   <nav><a href="/a-propos/">A Propos</a>&bull; <a href="/mentions-legales/">Mentions L&eacute;gales</a>&bull; <a href="https://www.hack-with-hyweene.com">https://www.hack-with-hyweene.com</a></nav>
  </footer>
 </body>
</html>
