<!DOCTYPE html>
<html lang="fr-FR" prefix="og: http://ogp.me/ns#">
 <head>
  <!-- Favicon -->
  <link href="https://www.hack-with-hyweene.com/static/img/cl-logo.svg" rel="icon">
  <meta charset="utf-8">
  <meta content="width=device-width, initial-scale=1, minimum-scale=1.0, maximum-scale=5.0" name="viewport">
  <meta content="IE=edge" http-equiv="X-UA-Compatible">
  <meta content="telephone=no" name="format-detection">
  <meta content="Bruno 'Hyweene' Giarrizzo" name="author">
  <meta content="Hack with Hyweene" name="webmaster">
  <meta content="fr" name="language">
  <meta content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" name="robots">
  <meta content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" name="googlebot">
  <meta content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" name="bingbot">
  <meta content="1 days" name="revisit-after">
  <meta content="never" name="expires">
  <meta content="General" name="rating">
  <meta content="yes" name="apple-mobile-web-app-capable">
  <meta content="https://www.hack-with-hyweene.com" name="identifier-URL">
  <link href="https://www.hack-with-hyweene.com/blog/feed.xml" rel="alternate" title="Hack with Hyweene - Blog RSS" type="application/rss+xml">
  <title>Intro - Swift - Apprendre - Hack with Hyweene</title>
  <meta content="Intro - Swift - Apprendre - Hack with Hyweene" name="title">
  <link href="https://www.hack-with-hyweene.com/" rel="canonical">
  <link href="/static/css/prism.css" rel="stylesheet">
  <!-- Google tag (gtag.js) -->
  <script async src="https://www.googletagmanager.com/gtag/js?id=G-S4T0SNK38Q">
  </script>
  <script src="/static/js/analytics.js">
  </script>
  <style>body { margin: 0 auto; max-width: 700px; line-height: 1.8; font-family: 'Latin Modern', Georgia, Cambria, 'Times New Roman', Times, serif; font-size: 1rem; color: #444; background-color: #fdf6e3; padding: 20px 40px; text-rendering: optimizeLegibility; }
    h1 { line-height: 1.2; text-align: center; }
    h2, h3, h4 { line-height: 1.2; border-bottom: 1px solid; }
    p { hyphens: auto; text-align: justify; }
    pre, blockquote, .code { background: #f5ead6; font-size: 0.8em; padding: 1em; overflow: scroll; border-radius: 0.5em; }
    ul, ol { list-style-type: circle; }
    a { color: #169; text-decoration: none; padding: 0.5em 0; }
    a:hover { text-decoration: underline; }
    
    nav { display: flex; align-items: center; justify-content: space-between; flex-direction: row; text-align: center; font-variant: small-caps; font-weight: bold; border-bottom: 1px solid; border-top: 1px solid; margin-bottom: 1.5em; }
    
    main { text-align: justify; }
    main hr { margin-top: 1.5em; margin-bottom: 1.5em; }

    .cover { display: block; width: 100%; border-radius: 0.5em; }

    figure { width: 65%; display: block; margin-left: auto; margin-right: auto;}
    figure img { width: 100%; box-shadow: rgba(0, 0, 0, 0.35) 0px 5px 15px; border-radius: 0.5em; }
    figure figcaption { text-align: center; font-style: italic; }

    footer { margin-top: 1.5em; }

    code { background: #f8cca0; padding: 0.25em;  margin-right: 0.5em; border-radius: 0.5em; }</style>
 </head>
 <body>
  <header>
   <h1><a href="/">Hack with Hyweene</a></h1>
  </header>
  <nav><a href="/blog/">Blog</a>&bull; <a href="/liens/">Liens</a>&bull; <a href="/apprendre/">Apprendre</a>&bull; <a href="/cv/">CV</a></nav>
  <main>
   <h1></h1>
   <h2>Intro</h2>
   <p>Swift est un langage de programmation objet, compil&eacute; et multi-paradigme. Il est con&ccedil;u pour &ecirc;tre rapide, s&ucirc;r et expressif.</p>
   <p>Le projet open-source, et son d&eacute;veloppement est g&eacute;r&eacute; par Apple qui en est le principal contributeur. Il a &eacute;t&eacute; concu &agrave; l'origine pour &ecirc;tre utilis&eacute; avec les syst&egrave;mes d'exploitation iOS, macOS, watchOS et tvOS, mais un support non-officiel existe pour les distributions Linux.</p>
   <h2>Historique</h2>
   <p>Le d&eacute;veloppement de Swift a d&eacute;but&eacute; en 2010 sous l'impulsion de Chris Lattner, alors ing&eacute;nieur chez Apple. L'objectif &eacute;tait de cr&eacute;er un langage moderne pour remplacer progressivement Objective-C, tout en restant compatible avec les frameworks existants d'Apple.
La premi&egrave;re version publique de Swift a &eacute;t&eacute; d&eacute;voil&eacute;e lors de la Worldwide Developers Conference (WWDC) d'Apple en juin 20141. Cette annonce a marqu&eacute; un tournant majeur pour le d&eacute;veloppement sur les plateformes Apple, offrant aux d&eacute;veloppeurs un langage plus s&ucirc;r, plus rapide et plus expressif.</p>
   <p>Un an plus tard, lors de la WWDC 2015, Apple a pr&eacute;sent&eacute; Swift 2.0, apportant de nombreuses am&eacute;liorations au langage. Mais l'annonce la plus importante fut la d&eacute;cision de rendre Swift open source, concr&eacute;tis&eacute;e en d&eacute;cembre 2015.</p>
   <p><a href="https://www.swift.org/blog/swift-2.2-released/">La version 2.2 de Swift, publi&eacute;e en mars 2016</a>, a marqu&eacute; une &eacute;tape cruciale en &eacute;tant la premi&egrave;re version officiellement open source2. Cette ouverture a permis &agrave; la communaut&eacute; de contribuer activement au d&eacute;veloppement du langage, &eacute;largissant ainsi son &eacute;cosyst&egrave;me au-del&agrave; des plateformes Apple.</p>
   <p><a href="https://www.swift.org/blog/swift-3.0-released/">Septembre 2016 a vu l'arriv&eacute;e de Swift 3.0</a>, une mise &agrave; jour majeure qui a introduit des changements significatifs dans la syntaxe et les conventions de nommage4. Cette version a &eacute;galement marqu&eacute; l'introduction de Swift Package Manager, un outil essentiel pour la gestion des d&eacute;pendances. Bien que ces modifications aient rompu la compatibilit&eacute; avec les versions ant&eacute;rieures, elles ont pos&eacute; les bases d'un langage plus coh&eacute;rent et plus puissant.</p>
   <p>Swift <a href="https://www.swift.org/blog/swift-4.0-released/">4.0, lanc&eacute; en septembre 2017</a>, s'est concentr&eacute; sur la stabilit&eacute; et la performance, tout en maintenant la compatibilit&eacute; avec Swift 34. Cette version a notamment introduit des fonctionnalit&eacute;s de s&eacute;rialisation am&eacute;lior&eacute;es, facilitant la manipulation des donn&eacute;es JSON et la cr&eacute;ation d'encodeurs et de d&eacute;codeurs personnalis&eacute;s.</p>
   <p>La version 5.0, sortie en mars 2019, a marqu&eacute; un jalon important avec la stabilisation de l'ABI (Application Binary Interface). Cette avanc&eacute;e a permis une meilleure interop&eacute;rabilit&eacute; entre les diff&eacute;rentes versions de Swift et a ouvert la voie &agrave; une adoption plus large du langage dans le d&eacute;veloppement syst&egrave;me.</p>
   <p>Les versions suivantes de Swift ont continu&eacute; &agrave; enrichir le langage. La <a href="https://www.swift.org/blog/swift-5.9-released/">version 5.9</a> a introduit un puissant syst&egrave;me de macros, offrant aux d&eacute;veloppeurs de nouvelles possibilit&eacute;s pour g&eacute;n&eacute;rer et manipuler du code. Elle a &eacute;galement apport&eacute; des am&eacute;liorations significatives dans la gestion de la m&eacute;moire et les performances, donnant aux d&eacute;veloppeurs un contr&ocirc;le plus fin sur ces aspects critiques.</p>
   <p>Avec <a href="https://www.swift.org/blog/swift-5.10-released/">Swift 5.10</a>, l'accent a &eacute;t&eacute; mis sur l'am&eacute;lioration du mod&egrave;le de concurrence. Cette version a introduit de nouveaux m&eacute;canismes pour isoler les donn&eacute;es et pr&eacute;venir les conditions de course, rendant le d&eacute;veloppement d'applications concurrentes plus s&ucirc;r et plus efficace.</p>
   <h2>Comment suivre ce module ?</h2>
   <p>Ce module peut &ecirc;tre suivi en utilisant XCode, ou Swift Playground. Mais il est recommand&eacute; de suivre en utilisant XCode.</p>
   <p>Pour les utilisateurs de XCode, cr&eacute;ez un nouveau projet et choisissez "Playground" pour commencer. Pour les utilisateurs de Swift Playground, ouvrez simplement l'application et cr&eacute;ez un nouveau fichier.</p>
   <script src="/static/js/prism.js">
   </script>
  </main>
  <footer>
   <nav><a href="/a-propos/">A Propos</a>&bull; <a href="/mentions-legales/">Mentions L&eacute;gales</a>&bull; <a href="https://www.hack-with-hyweene.com">https://www.hack-with-hyweene.com</a></nav>
  </footer>
 </body>
</html>
